tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "kitagry/tap"
tap "noahgorstein/tap"

# GNU replacements
brew "binutils"
brew "coreutils"
brew "findutils"
brew "grep"
brew "make"
brew "openssl"

# Built-in replacements
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "zoxide"

# Utils
brew "curl"
brew "dos2unix"
brew "fzf"
brew "git"
brew "ipcalc"
brew "jq"
brew "kitagry/tap/regols"
brew "mas"
brew "neovim"
brew "noahgorstein/tap/jqp"
brew "reattach-to-user-namespace"
brew "rtx"
brew "stow"
brew "tmux"
brew "trash"
brew "watch"
brew "wget"
brew "xclip"
brew "zsh"
brew "gpg"
brew "libpq" # postgres utilities, keg-only

# Kubernetes
brew "helm"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Casks
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "karabiner-elements"
cask "obsidian"
cask "rectangle"
cask "wireshark"
cask "yt-music"
