tap "homebrew/bundle"
tap "homebrew/services"
tap "samuong/alpaca"
tap "robscott/tap"
tap "minio/stable"
tap "norwoodj/tap"
tap "txn2/tap"

brew "antidote"
brew "openssl@3"
brew "azure-cli"
brew "bat"
brew "binutils"
brew "diffutils"
brew "gettext"
brew "cmake"
brew "colima"
brew "coreutils"
brew "corkscrew"
brew "curl"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "dos2unix"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "libb2"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "gnupg"
brew "go-jsonnet"
brew "grep"
brew "helm"
brew "imagemagick"
brew "pkgconf"
brew "ipcalc"
brew "jfrog-cli"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "krew"
brew "kube-score"
brew "kubectx"
brew "kustomize"
brew "libgit2@1.7"
brew "libpq", link: true
brew "make"
brew "mas"
brew "mise"
brew "neovim"
brew "netcat"
brew "ninja"
brew "opa"
brew "opentofu"
brew "parallel"
brew "pinentry-mac"
brew "pngpaste"
brew "qemu"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "skopeo"
brew "slides"
brew "stow"
brew "terraform-docs"
brew "terragrunt"
brew "tmux"
brew "trash", link: true
brew "vivid"
brew "watch"
brew "watchexec"
brew "wget"
brew "xclip"
brew "yq"
brew "zoxide"
brew "zsh"
brew "minio/stable/mc"
brew "norwoodj/tap/helm-docs"
brew "robscott/tap/kube-capacity"
brew "samuong/alpaca/alpaca"
brew "txn2/tap/kubefwd"

cask "1password"
cask "1password-cli"
cask "daisydisk"
cask "datagrip"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "miro"
cask "obs"
cask "obsidian"
cask "raycast"
# cask "telegram-desktop"
cask "winbox"
cask "zen-browser"

mas "Microsoft Remote Desktop", id: 1295203466
mas "WireGuard", id: 1451685025
